{
  "architectures": [
    "Gemma4ForConditionalGeneration"
  ],
  "audio_config": {
    "_name_or_path": "",
    "architectures": null,
    "attention_chunk_size": 12,
    "attention_context_left": 13,
    "attention_context_right": 0,
    "attention_invalid_logits_value": -1000000000.0,
    "attention_logit_cap": 50.0,
    "chunk_size_feed_forward": 0,
    "conv_kernel_size": 5,
    "dtype": "bfloat16",
    "gradient_clipping": 10000000000.0,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "model_type": "gemma4_audio",
    "num_attention_heads": 8,
    "num_hidden_layers": 12,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_proj_dims": 1536,
    "problem_type": null,
    "residual_weight": 0.5,
    "return_dict": true,
    "rms_norm_eps": 1e-06,
    "subsampling_conv_channels": [
      128,
      32
    ],
    "use_clipped_linears": true
  },
  "audio_token_id": 258881,
  "boa_token_id": 256000,
  "boi_token_id": 255999,
  "dtype": "bfloat16",
  "eoa_token_id": 258883,
  "eoa_token_index": 258883,
  "eoi_token_id": 258882,
  "eos_token_id": [
    1,
    106
  ],
  "image_token_id": 258880,
  "initializer_range": 0.02,
  "model_type": "gemma4",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_k_eq_v": false,
    "bos_token_id": 2,
    "dtype": "bfloat16",
    "enable_moe_block": false,
    "eos_token_id": 1,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 512,
    "head_dim": 256,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 2560,
    "hidden_size_per_layer_input": 256,
    "initializer_range": 0.02,
    "intermediate_size": 10240,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 131072,
    "model_type": "gemma4_text",
    "moe_intermediate_size": null,
    "num_attention_heads": 8,
    "num_experts": null,
    "num_global_key_value_heads": null,
    "num_hidden_layers": 42,
    "num_key_value_heads": 2,
    "num_kv_shared_layers": 18,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.25,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 512,
    "tie_word_embeddings": false,
    "top_k_experts": null,
    "use_bidirectional_attention": null,
    "use_cache": true,
    "use_double_wide_mlp": false,
    "vocab_size": 262144,
    "vocab_size_per_layer_input": 262144
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.6.2",
  "video_token_id": 258884,
  "vision_config": {
    "_name_or_path": "",
    "architectures": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "chunk_size_feed_forward": 0,
    "default_output_length": 280,
    "dtype": "bfloat16",
    "global_head_dim": 64,
    "head_dim": 64,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "max_position_embeddings": 131072,
    "model_type": "gemma4_vision",
    "num_attention_heads": 12,
    "num_hidden_layers": 16,
    "num_key_value_heads": 12,
    "output_attentions": false,
    "output_hidden_states": false,
    "patch_size": 16,
    "pooling_kernel_size": 3,
    "position_embedding_size": 10240,
    "problem_type": null,
    "return_dict": true,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 100.0,
      "rope_type": "default"
    },
    "standardize": false,
    "use_clipped_linears": true
  },
  "vision_soft_tokens_per_image": 280,
  "quantization_config": {
    "config_groups": {
      "group_0": {
        "format": "pack-quantized",
        "input_activations": null,
        "output_activations": null,
        "targets": [
          "Linear"
        ],
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": 128,
          "num_bits": 4,
          "observer": "minmax",
          "observer_kwargs": {},
          "scale_dtype": null,
          "strategy": "group",
          "symmetric": true,
          "type": "int",
          "zp_dtype": null
        }
      },
      "group_1": {
        "format": "pack-quantized",
        "input_activations": null,
        "output_activations": null,
        "targets": [
          "re:.*lm_head"
        ],
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": 128,
          "num_bits": 4,
          "observer": "minmax",
          "observer_kwargs": {},
          "scale_dtype": null,
          "strategy": "group",
          "symmetric": true,
          "type": "int",
          "zp_dtype": null
        }
      }
    },
    "format": "pack-quantized",
    "global_compression_ratio": null,
    "ignore": [
      "model.vision_tower.patch_embedder.input_proj",
      "model.vision_tower.encoder.layers.0.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.0.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.0.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.0.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.0.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.0.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.0.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.1.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.1.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.1.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.2.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.2.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.2.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.3.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.3.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.3.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.4.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.4.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.4.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.5.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.5.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.5.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.6.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.6.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.6.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.7.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.7.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.7.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.8.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.8.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.8.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.9.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.9.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.9.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.10.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.10.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.10.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.11.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.11.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.11.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.12.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.12.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.12.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.13.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.13.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.13.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.14.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.14.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.14.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.15.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.15.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.15.mlp.down_proj.linear",
      "model.audio_tower.subsample_conv_projection.input_proj_linear",
      "model.audio_tower.layers.0.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.0.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.0.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.0.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.0.self_attn.q_proj.linear",
      "model.audio_tower.layers.0.self_attn.k_proj.linear",
      "model.audio_tower.layers.0.self_attn.v_proj.linear",
      "model.audio_tower.layers.0.self_attn.post.linear",
      "model.audio_tower.layers.0.self_attn.relative_k_proj",
      "model.audio_tower.layers.0.lconv1d.linear_start.linear",
      "model.audio_tower.layers.0.lconv1d.linear_end.linear",
      "model.audio_tower.layers.1.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.1.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.1.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.1.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.1.self_attn.q_proj.linear",
      "model.audio_tower.layers.1.self_attn.k_proj.linear",
      "model.audio_tower.layers.1.self_attn.v_proj.linear",
      "model.audio_tower.layers.1.self_attn.post.linear",
      "model.audio_tower.layers.1.self_attn.relative_k_proj",
      "model.audio_tower.layers.1.lconv1d.linear_start.linear",
      "model.audio_tower.layers.1.lconv1d.linear_end.linear",
      "model.audio_tower.layers.2.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.2.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.2.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.2.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.2.self_attn.q_proj.linear",
      "model.audio_tower.layers.2.self_attn.k_proj.linear",
      "model.audio_tower.layers.2.self_attn.v_proj.linear",
      "model.audio_tower.layers.2.self_attn.post.linear",
      "model.audio_tower.layers.2.self_attn.relative_k_proj",
      "model.audio_tower.layers.2.lconv1d.linear_start.linear",
      "model.audio_tower.layers.2.lconv1d.linear_end.linear",
      "model.audio_tower.layers.3.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.3.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.3.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.3.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.3.self_attn.q_proj.linear",
      "model.audio_tower.layers.3.self_attn.k_proj.linear",
      "model.audio_tower.layers.3.self_attn.v_proj.linear",
      "model.audio_tower.layers.3.self_attn.post.linear",
      "model.audio_tower.layers.3.self_attn.relative_k_proj",
      "model.audio_tower.layers.3.lconv1d.linear_start.linear",
      "model.audio_tower.layers.3.lconv1d.linear_end.linear",
      "model.audio_tower.layers.4.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.4.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.4.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.4.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.4.self_attn.q_proj.linear",
      "model.audio_tower.layers.4.self_attn.k_proj.linear",
      "model.audio_tower.layers.4.self_attn.v_proj.linear",
      "model.audio_tower.layers.4.self_attn.post.linear",
      "model.audio_tower.layers.4.self_attn.relative_k_proj",
      "model.audio_tower.layers.4.lconv1d.linear_start.linear",
      "model.audio_tower.layers.4.lconv1d.linear_end.linear",
      "model.audio_tower.layers.5.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.5.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.5.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.5.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.5.self_attn.q_proj.linear",
      "model.audio_tower.layers.5.self_attn.k_proj.linear",
      "model.audio_tower.layers.5.self_attn.v_proj.linear",
      "model.audio_tower.layers.5.self_attn.post.linear",
      "model.audio_tower.layers.5.self_attn.relative_k_proj",
      "model.audio_tower.layers.5.lconv1d.linear_start.linear",
      "model.audio_tower.layers.5.lconv1d.linear_end.linear",
      "model.audio_tower.layers.6.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.6.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.6.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.6.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.6.self_attn.q_proj.linear",
      "model.audio_tower.layers.6.self_attn.k_proj.linear",
      "model.audio_tower.layers.6.self_attn.v_proj.linear",
      "model.audio_tower.layers.6.self_attn.post.linear",
      "model.audio_tower.layers.6.self_attn.relative_k_proj",
      "model.audio_tower.layers.6.lconv1d.linear_start.linear",
      "model.audio_tower.layers.6.lconv1d.linear_end.linear",
      "model.audio_tower.layers.7.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.7.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.7.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.7.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.7.self_attn.q_proj.linear",
      "model.audio_tower.layers.7.self_attn.k_proj.linear",
      "model.audio_tower.layers.7.self_attn.v_proj.linear",
      "model.audio_tower.layers.7.self_attn.post.linear",
      "model.audio_tower.layers.7.self_attn.relative_k_proj",
      "model.audio_tower.layers.7.lconv1d.linear_start.linear",
      "model.audio_tower.layers.7.lconv1d.linear_end.linear",
      "model.audio_tower.layers.8.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.8.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.8.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.8.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.8.self_attn.q_proj.linear",
      "model.audio_tower.layers.8.self_attn.k_proj.linear",
      "model.audio_tower.layers.8.self_attn.v_proj.linear",
      "model.audio_tower.layers.8.self_attn.post.linear",
      "model.audio_tower.layers.8.self_attn.relative_k_proj",
      "model.audio_tower.layers.8.lconv1d.linear_start.linear",
      "model.audio_tower.layers.8.lconv1d.linear_end.linear",
      "model.audio_tower.layers.9.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.9.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.9.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.9.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.9.self_attn.q_proj.linear",
      "model.audio_tower.layers.9.self_attn.k_proj.linear",
      "model.audio_tower.layers.9.self_attn.v_proj.linear",
      "model.audio_tower.layers.9.self_attn.post.linear",
      "model.audio_tower.layers.9.self_attn.relative_k_proj",
      "model.audio_tower.layers.9.lconv1d.linear_start.linear",
      "model.audio_tower.layers.9.lconv1d.linear_end.linear",
      "model.audio_tower.layers.10.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.10.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.10.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.10.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.10.self_attn.q_proj.linear",
      "model.audio_tower.layers.10.self_attn.k_proj.linear",
      "model.audio_tower.layers.10.self_attn.v_proj.linear",
      "model.audio_tower.layers.10.self_attn.post.linear",
      "model.audio_tower.layers.10.self_attn.relative_k_proj",
      "model.audio_tower.layers.10.lconv1d.linear_start.linear",
      "model.audio_tower.layers.10.lconv1d.linear_end.linear",
      "model.audio_tower.layers.11.feed_forward1.ffw_layer_1.linear",
      "model.audio_tower.layers.11.feed_forward1.ffw_layer_2.linear",
      "model.audio_tower.layers.11.feed_forward2.ffw_layer_1.linear",
      "model.audio_tower.layers.11.feed_forward2.ffw_layer_2.linear",
      "model.audio_tower.layers.11.self_attn.q_proj.linear",
      "model.audio_tower.layers.11.self_attn.k_proj.linear",
      "model.audio_tower.layers.11.self_attn.v_proj.linear",
      "model.audio_tower.layers.11.self_attn.post.linear",
      "model.audio_tower.layers.11.self_attn.relative_k_proj",
      "model.audio_tower.layers.11.lconv1d.linear_start.linear",
      "model.audio_tower.layers.11.lconv1d.linear_end.linear",
      "model.audio_tower.output_proj",
      "model.embed_vision.embedding_projection",
      "model.embed_audio.embedding_projection"
    ],
    "kv_cache_scheme": null,
    "quant_method": "compressed-tensors",
    "quantization_status": "compressed",
    "sparsity_config": {
      "format": "sparse-24-bitmask",
      "targets": [
        "re:.*mlp\\.(gate_proj|up_proj|down_proj)$"
      ],
      "sparsity_structure": "2:4"
    },
    "transform_config": {},
    "version": "0.15.0.1"
  }
}